In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['Milan','Nirmal','Meera','Hinali','Krisha'],
    "marks":[56,43,32,34,75],
    "city":['surat','mumbai','chennai','kolkata','ahmedabad']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  marks       city
0   Milan     56      surat
1  Nirmal     43     mumbai
2   Meera     32    chennai
3  Hinali     34    kolkata
4  Krisha     75  ahmedabad

In [5]:
df.to_csv('friends.csv')

In [6]:
df.to_csv('friends_index_false.csv', index=False)

In [7]:
df.head(2)

     name  marks    city
0   Milan     56   surat
1  Nirmal     43  mumbai

In [8]:
df.tail(2)

     name  marks       city
3  Hinali     34    kolkata
4  Krisha     75  ahmedabad

In [9]:
df.describe()

          marks
count   5.00000
mean   48.00000
std    17.81853
min    32.00000
25%    34.00000
50%    43.00000
75%    56.00000
max    75.00000

In [10]:
train = pd.read_csv('train_data.csv', sep=';')

In [11]:
train

   Train no  Speed    City
0      1234     32   Surat
1      4678     98  mumbai
2      8648     66   delhi
3      8747     34    pune

In [12]:
train['Speed']

0    32
1    98
2    66
3    34
Name: Speed, dtype: int64

In [13]:
train['Speed'][0]

32

In [14]:
train['Speed'][0] = 50

<ipython-input-14-d88a1bbb3d16>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['Speed'][0] = 50

In [15]:
train['Speed']

0    50
1    98
2    66
3    34
Name: Speed, dtype: int64

In [16]:
train.to_csv('train.csv')

In [17]:
train.index = ['first','second','third','fourth']

In [18]:
train

        Train no  Speed    City
first       1234     50   Surat
second      4678     98  mumbai
third       8648     66   delhi
fourth      8747     34    pune

In [21]:
ser = pd.Series(np.random.rand(34))

In [22]:
ser

0     0.722297
1     0.475936
2     0.798209
3     0.517028
4     0.392872
5     0.119012
6     0.160022
7     0.649580
8     0.380079
9     0.136786
10    0.129288
11    0.481096
12    0.100675
13    0.100682
14    0.445706
15    0.423007
16    0.924997
17    0.568301
18    0.752026
19    0.581387
20    0.143574
21    0.218483
22    0.595694
23    0.149689
24    0.916295
25    0.271320
26    0.244305
27    0.616135
28    0.850323
29    0.011697
30    0.762909
31    0.897427
32    0.551666
33    0.384585
dtype: float64

In [23]:
type(ser)

pandas.core.series.Series

In [25]:
newdf = pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [27]:
newdf.head()

          0         1         2         3         4
0  0.450044  0.962856  0.893795  0.962048  0.777684
1  0.863685  0.642215  0.393404  0.944740  0.074793
2  0.289197  0.719574  0.208018  0.955647  0.952876
3  0.433750  0.144039  0.968164  0.708239  0.622797
4  0.155290  0.609277  0.748685  0.938403  0.887445

In [28]:
type(newdf)

pandas.core.frame.DataFrame

In [48]:
newdf.describe()

                1           2           3           4
count  334.000000  334.000000  334.000000  334.000000
mean     0.477745    0.521043    0.512768    0.491221
std      0.304183    0.276216    0.294572    0.293253
min      0.001874    0.003612    0.007177    0.002009
25%      0.192853    0.311394    0.260499    0.248804
50%      0.491573    0.541045    0.526188    0.480502
75%      0.745843    0.731467    0.764858    0.750184
max      0.996369    0.999714    0.997706    0.999216

In [49]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [50]:
newdf[0][0] = 0.4343343

<ipython-input-50-9b62ae630846>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf[0][0] = 0.4343343

In [51]:
newdf.head()

          0         1         2         3         4
0  0.434334  0.962856  0.893795  0.962048  0.777684
1  0.863685  0.642215  0.393404  0.944740  0.074793
2  0.289197  0.719574  0.208018  0.955647  0.952876
3   0.43375  0.144039  0.968164  0.708239  0.622797
4   0.15529  0.609277  0.748685  0.938403  0.887445

In [52]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [53]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [55]:
newdf.to_numpy()

array([[0.4343343, 0.9628561502974431, 0.8937948782087322,
        0.9620482914769399, 0.7776841292186886],
       [0.86368472633956, 0.642214699361062, 0.393403518885284,
        0.9447402660104484, 0.0747930000903223],
       [0.28919668791628883, 0.719573602440691, 0.20801785282931196,
        0.9556474101163431, 0.9528757588106879],
       ...,
       [0.2126156841669431, 0.5678156134385393, 0.9456969603897505,
        0.7610519019979916, 0.14179758942887322],
       [0.5049967387088248, 0.0858075406650406, 0.23538661148850915,
        0.3472434566597492, 0.33589507396706075],
       [0.6185210909338253, 0.9779001675359635, 0.03699623091286719,
        0.22033035349144114, 0.6379817865533641]], dtype=object)

In [56]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.434334,0.863685,0.289197,0.43375,0.15529,0.562962,0.707482,0.115223,0.631067,0.0625604,...,0.475869,0.482295,0.938922,0.0249374,0.870025,0.194471,0.450367,0.212616,0.504997,0.618521
1,0.962856,0.642215,0.719574,0.144039,0.609277,0.659805,0.972115,0.0801401,0.0931266,0.0847411,...,0.146151,0.311412,0.983481,0.166324,0.630124,0.0136709,0.0782143,0.567816,0.0858075,0.9779
2,0.893795,0.393404,0.208018,0.968164,0.748685,0.473567,0.674044,0.909562,0.836531,0.855961,...,0.0110958,0.633493,0.82181,0.59771,0.2049,0.156223,0.709869,0.945697,0.235387,0.0369962
3,0.962048,0.94474,0.955647,0.708239,0.938403,0.173858,0.178881,0.387216,0.788789,0.166811,...,0.812771,0.571023,0.743428,0.728977,0.755734,0.339629,0.903542,0.761052,0.347243,0.22033
4,0.777684,0.074793,0.952876,0.622797,0.887445,0.65436,0.383319,0.414753,0.575607,0.32906,...,0.638444,0.671437,0.349935,0.385691,0.956153,0.617995,0.412604,0.141798,0.335895,0.637982

In [58]:
newdf.head()

          0         1         2         3         4
0  0.434334  0.962856  0.893795  0.962048  0.777684
1  0.863685  0.642215  0.393404  0.944740  0.074793
2  0.289197  0.719574  0.208018  0.955647  0.952876
3   0.43375  0.144039  0.968164  0.708239  0.622797
4   0.15529  0.609277  0.748685  0.938403  0.887445

In [62]:
newdf.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.777684  0.962048  0.893795  0.962856  0.434334
1    0.074793  0.944740  0.393404  0.642215  0.863685
2    0.952876  0.955647  0.208018  0.719574  0.289197
3    0.622797  0.708239  0.968164  0.144039   0.43375
4    0.887445  0.938403  0.748685  0.609277   0.15529
..        ...       ...       ...       ...       ...
329  0.617995  0.339629  0.156223  0.013671  0.194471
330  0.412604  0.903542  0.709869  0.078214  0.450367
331  0.141798  0.761052  0.945697  0.567816  0.212616
332  0.335895  0.347243  0.235387  0.085808  0.504997
333  0.637982  0.220330  0.036996  0.977900  0.618521

[334 rows x 5 columns]

In [65]:
type(newdf[0])

pandas.core.series.Series

In [70]:
newdf2 = newdf.copy

In [74]:
newdf2[0][0] = 0.232323232

TypeError: 'method' object is not subscriptable

In [75]:
newdf

            0         1         2         3         4
0      438423  0.962856  0.893795  0.962048  0.777684
1    0.863685  0.642215  0.393404  0.944740  0.074793
2    0.289197  0.719574  0.208018  0.955647  0.952876
3     0.43375  0.144039  0.968164  0.708239  0.622797
4     0.15529  0.609277  0.748685  0.938403  0.887445
..        ...       ...       ...       ...       ...
329  0.194471  0.013671  0.156223  0.339629  0.617995
330  0.450367  0.078214  0.709869  0.903542  0.412604
331  0.212616  0.567816  0.945697  0.761052  0.141798
332  0.504997  0.085808  0.235387  0.347243  0.335895
333  0.618521  0.977900  0.036996  0.220330  0.637982

[334 rows x 5 columns]

In [76]:
newdf.loc[0,0] = 353

In [78]:
newdf.head(2)

          0         1         2         3         4
0       353  0.962856  0.893795  0.962048  0.777684
1  0.863685  0.642215  0.393404  0.944740  0.074793

In [79]:
newdf.columns = list("ABCDE")

In [80]:
newdf.head(2)

          A         B         C         D         E
0       353  0.962856  0.893795  0.962048  0.777684
1  0.863685  0.642215  0.393404  0.944740  0.074793

In [83]:
newdf.loc[0,'A'] = 353

In [84]:
newdf.head(2)

          A         B         C         D         E      0
0       353  0.962856  0.893795  0.962048  0.777684  353.0
1  0.863685  0.642215  0.393404  0.944740  0.074793    NaN

In [87]:
newdf = newdf.drop(0,axis=1)

In [89]:
newdf.head()

          A         B         C         D         E
0       353  0.962856  0.893795  0.962048  0.777684
1  0.863685  0.642215  0.393404  0.944740  0.074793
2  0.289197  0.719574  0.208018  0.955647  0.952876
3   0.43375  0.144039  0.968164  0.708239  0.622797
4   0.15529  0.609277  0.748685  0.938403  0.887445

In [90]:
newdf.loc[[1,2],['C','D']]

          C         D
1  0.393404  0.944740
2  0.208018  0.955647

In [95]:
newdf.loc[(newdf['A']<0.3) & (newdf['C']>0.1)]

             A         B         C         D         E
2     0.289197  0.719574  0.208018  0.955647  0.952876
4      0.15529  0.609277  0.748685  0.938403  0.887445
7     0.115223  0.080140  0.909562  0.387216  0.414753
9    0.0625604  0.084741  0.855961  0.166811  0.329060
16     0.10423  0.498675  0.347681  0.807711  0.047916
..         ...       ...       ...       ...       ...
318   0.092412  0.981902  0.999714  0.012163  0.787042
321   0.232484  0.894509  0.983081  0.880446  0.630048
327  0.0249374  0.166324  0.597710  0.728977  0.385691
329   0.194471  0.013671  0.156223  0.339629  0.617995
331   0.212616  0.567816  0.945697  0.761052  0.141798

[90 rows x 5 columns]

In [97]:
newdf.head(2)

          A         B         C         D         E
0       353  0.962856  0.893795  0.962048  0.777684
1  0.863685  0.642215  0.393404  0.944740  0.074793

In [101]:
newdf.iloc[0,4]

0.7776841292186886

In [104]:
newdf.reset_index(drop=True, inplace=True)

In [105]:
newdf.head()

          A         B         C         D         E
0       353  0.962856  0.893795  0.962048  0.777684
1  0.863685  0.642215  0.393404  0.944740  0.074793
2  0.289197  0.719574  0.208018  0.955647  0.952876
3   0.43375  0.144039  0.968164  0.708239  0.622797
4   0.15529  0.609277  0.748685  0.938403  0.887445

In [107]:
newdf['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
329    False
330    False
331    False
332    False
333    False
Name: B, Length: 334, dtype: bool

In [112]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Alfred'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [113]:
df.head()

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [115]:
df.dropna(how='all', axis=1)

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [117]:
df.drop_duplicates(subset=['name'])

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25

In [118]:
df.shape

(3, 3)

In [120]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 200.0+ bytes

In [121]:
df.notnull()

   name    toy   born
0  True  False  False
1  True   True   True
2  True   True  False

In [127]:
spedf = pd.DataFrame({"Name": ['JKM', 'PPD', 'JVD','JHD'],
                   "Temple": ['Galdhara', 'Dolti', 'Virpur','Kerala']
                  })

In [128]:
spedf

  Name    Temple
0  JKM  Galdhara
1  PPD     Dolti
2  JVD    Virpur
3  JHD    Kerala

In [129]:
df.describe()

<ipython-input-129-ea8415b8a3ee>:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  df.describe()

          name       toy                 born
count        3         2                    1
unique       2         2                    1
top     Alfred  Bullwhip  1940-04-25 00:00:00
freq         2         1                    1
first      NaN       NaN  1940-04-25 00:00:00
last       NaN       NaN  1940-04-25 00:00:00

In [130]:
df.mean()

<ipython-input-130-c61f0c8f89b5>:1: FutureWarning: DataFrame.mean and DataFrame.median with numeric_only=None will include datetime64 and datetime64tz columns in a future version.
  df.mean()

Series([], dtype: float64)

In [131]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [132]:
df.shape

(3, 3)

In [133]:
df.info

<bound method DataFrame.info of      name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT>